{"format": "layers-model", "generatedBy": null, "convertedBy": "TensorFlow.js Converter v3.19.0", "modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of22.bin", "group1-shard2of22.bin", "group1-shard3of22.bin", "group1-shard4of22.bin", "group1-shard5of22.bin", "group1-shard6of22.bin", "group1-shard7of22.bin", "group1-shard8of22.bin", "group1-shard9of22.bin", "group1-shard10of22.bin", "group1-shard11of22.bin", "group1-shard12of22.bin", "group1-shard13of22.bin", "group1-shard14of22.bin", "group1-shard15of22.bin", "group1-shard16of22.bin", "group1-shard17of22.bin", "group1-shard18of22.bin", "group1-shard19of22.bin", "group1-shard20of22.bin", "group1-shard21of22.bin", "group1-shard22of22.bin"], "weights": [{"name": "Conv2d_1a_3x3/kernel", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "Conv2d_1a_3x3_BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "Conv2d_1a_3x3_BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "Conv2d_1a_3x3_BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "Conv2d_2a_3x3/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "Conv2d_2a_3x3_BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "Conv2d_2a_3x3_BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "Conv2d_2a_3x3_BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "Conv2d_2b_3x3/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "Conv2d_2b_3x3_BatchNorm/beta", "shape": [64], "dtype": "float32"}, {"name": "Conv2d_2b_3x3_BatchNorm/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "Conv2d_2b_3x3_BatchNorm/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "Conv2d_3b_1x1/kernel", "shape": [1, 1, 64, 80], "dtype": "float32"}, {"name": "Conv2d_3b_1x1_BatchNorm/beta", "shape": [80], "dtype": "float32"}, {"name": "Conv2d_3b_1x1_BatchNorm/moving_mean", "shape": [80], "dtype": "float32"}, {"name": "Conv2d_3b_1x1_BatchNorm/moving_variance", "shape": [80], "dtype": "float32"}, {"name": "Conv2d_4a_3x3/kernel", "shape": [3, 3, 80, 192], "dtype": "float32"}, {"name": "Conv2d_4a_3x3_BatchNorm/beta", "shape": [192], "dtype": "float32"}, {"name": "Conv2d_4a_3x3_BatchNorm/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "Conv2d_4a_3x3_BatchNorm/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "Conv2d_4b_3x3/kernel", "shape": [3, 3, 192, 256], "dtype": "float32"}, {"name": "Conv2d_4b_3x3_BatchNorm/beta", "shape": [256], "dtype": "float32"}, {"name": "Conv2d_4b_3x3_BatchNorm/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "Conv2d_4b_3x3_BatchNorm/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "Block35_1_Branch_2_Conv2d_0a_1x1/kernel", "shape": [1, 1, 256, 32], "dtype": "float32"}, {"name": "Block35_1_Branch_2_Conv2d_0a_1x1_BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "Block35_1_Branch_2_Conv2d_0a_1x1_BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "Block35_1_Branch_2_Conv2d_0a_1x1_BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "Block35_1_Branch_1_Conv2d_0a_1x1/kernel", "shape": [1, 1, 256, 32], "dtype": "float32"}, {"name": "Block35_1_Branch_2_Conv2d_0b_3x3/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "Block35_1_Branch_1_Conv2d_0a_1x1_BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "Block35_1_Branch_1_Conv2d_0a_1x1_BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "Block35_1_Branch_1_Conv2d_0a_1x1_BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "Block35_1_Branch_2_Conv2d_0b_3x3_BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "Block35_1_Branch_2_Conv2d_0b_3x3_BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "Block35_1_Branch_2_Conv2d_0b_3x3_BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "Block35_1_Branch_0_Conv2d_1x1/kernel", "shape": [1, 1, 256, 32], "dtype": "float32"}, {"name": "Block35_1_Branch_1_Conv2d_0b_3x3/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "Block35_1_Branch_2_Conv2d_0c_3x3/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "Block35_1_Branch_0_Conv2d_1x1_BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "Block35_1_Branch_0_Conv2d_1x1_BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "Block35_1_Branch_0_Conv2d_1x1_BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "Block35_1_Branch_1_Conv2d_0b_3x3_BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "Block35_1_Branch_1_Conv2d_0b_3x3_BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "Block35_1_Branch_1_Conv2d_0b_3x3_BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "Block35_1_Branch_2_Conv2d_0c_3x3_BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "Block35_1_Branch_2_Conv2d_0c_3x3_BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "Block35_1_Branch_2_Conv2d_0c_3x3_BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "Block35_1_Conv2d_1x1/kernel", "shape": [1, 1, 96, 256], "dtype": "float32"}, {"name": "Block35_1_Conv2d_1x1/bias", "shape": [256], "dtype": "float32"}, {"name": "Block35_2_Branch_2_Conv2d_0a_1x1/kernel", "shape": [1, 1, 256, 32], "dtype": "float32"}, {"name": "Block35_2_Branch_2_Conv2d_0a_1x1_BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "Block35_2_Branch_2_Conv2d_0a_1x1_BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "Block35_2_Branch_2_Conv2d_0a_1x1_BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "Block35_2_Branch_1_Conv2d_0a_1x1/kernel", "shape": [1, 1, 256, 32], "dtype": "float32"}, {"name": "Block35_2_Branch_2_Conv2d_0b_3x3/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "Block35_2_Branch_1_Conv2d_0a_1x1_BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "Block35_2_Branch_1_Conv2d_0a_1x1_BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "Block35_2_Branch_1_Conv2d_0a_1x1_BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "Block35_2_Branch_2_Conv2d_0b_3x3_BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "Block35_2_Branch_2_Conv2d_0b_3x3_BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "Block35_2_Branch_2_Conv2d_0b_3x3_BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "Block35_2_Branch_0_Conv2d_1x1/kernel", "shape": [1, 1, 256, 32], "dtype": "float32"}, {"name": "Block35_2_Branch_1_Conv2d_0b_3x3/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "Block35_2_Branch_2_Conv2d_0c_3x3/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "Block35_2_Branch_0_Conv2d_1x1_BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "Block35_2_Branch_0_Conv2d_1x1_BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "Block35_2_Branch_0_Conv2d_1x1_BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "Block35_2_Branch_1_Conv2d_0b_3x3_BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "Block35_2_Branch_1_Conv2d_0b_3x3_BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "Block35_2_Branch_1_Conv2d_0b_3x3_BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "Block35_2_Branch_2_Conv2d_0c_3x3_BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "Block35_2_Branch_2_Conv2d_0c_3x3_BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "Block35_2_Branch_2_Conv2d_0c_3x3_BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "Block35_2_Conv2d_1x1/kernel", "shape": [1, 1, 96, 256], "dtype": "float32"}, {"name": "Block35_2_Conv2d_1x1/bias", "shape": [256], "dtype": "float32"}, {"name": "Block35_3_Branch_2_Conv2d_0a_1x1/kernel", "shape": [1, 1, 256, 32], "dtype": "float32"}, {"name": "Block35_3_Branch_2_Conv2d_0a_1x1_BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "Block35_3_Branch_2_Conv2d_0a_1x1_BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "Block35_3_Branch_2_Conv2d_0a_1x1_BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "Block35_3_Branch_1_Conv2d_0a_1x1/kernel", "shape": [1, 1, 256, 32], "dtype": "float32"}, {"name": "Block35_3_Branch_2_Conv2d_0b_3x3/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "Block35_3_Branch_1_Conv2d_0a_1x1_BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "Block35_3_Branch_1_Conv2d_0a_1x1_BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "Block35_3_Branch_1_Conv2d_0a_1x1_BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "Block35_3_Branch_2_Conv2d_0b_3x3_BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "Block35_3_Branch_2_Conv2d_0b_3x3_BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "Block35_3_Branch_2_Conv2d_0b_3x3_BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "Block35_3_Branch_0_Conv2d_1x1/kernel", "shape": [1, 1, 256, 32], "dtype": "float32"}, {"name": "Block35_3_Branch_1_Conv2d_0b_3x3/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "Block35_3_Branch_2_Conv2d_0c_3x3/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "Block35_3_Branch_0_Conv2d_1x1_BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "Block35_3_Branch_0_Conv2d_1x1_BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "Block35_3_Branch_0_Conv2d_1x1_BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "Block35_3_Branch_1_Conv2d_0b_3x3_BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "Block35_3_Branch_1_Conv2d_0b_3x3_BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "Block35_3_Branch_1_Conv2d_0b_3x3_BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "Block35_3_Branch_2_Conv2d_0c_3x3_BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "Block35_3_Branch_2_Conv2d_0c_3x3_BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "Block35_3_Branch_2_Conv2d_0c_3x3_BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "Block35_3_Conv2d_1x1/kernel", "shape": [1, 1, 96, 256], "dtype": "float32"}, {"name": "Block35_3_Conv2d_1x1/bias", "shape": [256], "dtype": "float32"}, {"name": "Block35_4_Branch_2_Conv2d_0a_1x1/kernel", "shape": [1, 1, 256, 32], "dtype": "float32"}, {"name": "Block35_4_Branch_2_Conv2d_0a_1x1_BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "Block35_4_Branch_2_Conv2d_0a_1x1_BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "Block35_4_Branch_2_Conv2d_0a_1x1_BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "Block35_4_Branch_1_Conv2d_0a_1x1/kernel", "shape": [1, 1, 256, 32], "dtype": "float32"}, {"name": "Block35_4_Branch_2_Conv2d_0b_3x3/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "Block35_4_Branch_1_Conv2d_0a_1x1_BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "Block35_4_Branch_1_Conv2d_0a_1x1_BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "Block35_4_Branch_1_Conv2d_0a_1x1_BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "Block35_4_Branch_2_Conv2d_0b_3x3_BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "Block35_4_Branch_2_Conv2d_0b_3x3_BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "Block35_4_Branch_2_Conv2d_0b_3x3_BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "Block35_4_Branch_0_Conv2d_1x1/kernel", "shape": [1, 1, 256, 32], "dtype": "float32"}, {"name": "Block35_4_Branch_1_Conv2d_0b_3x3/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "Block35_4_Branch_2_Conv2d_0c_3x3/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "Block35_4_Branch_0_Conv2d_1x1_BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "Block35_4_Branch_0_Conv2d_1x1_BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "Block35_4_Branch_0_Conv2d_1x1_BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "Block35_4_Branch_1_Conv2d_0b_3x3_BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "Block35_4_Branch_1_Conv2d_0b_3x3_BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "Block35_4_Branch_1_Conv2d_0b_3x3_BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "Block35_4_Branch_2_Conv2d_0c_3x3_BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "Block35_4_Branch_2_Conv2d_0c_3x3_BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "Block35_4_Branch_2_Conv2d_0c_3x3_BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "Block35_4_Conv2d_1x1/kernel", "shape": [1, 1, 96, 256], "dtype": "float32"}, {"name": "Block35_4_Conv2d_1x1/bias", "shape": [256], "dtype": "float32"}, {"name": "Block35_5_Branch_2_Conv2d_0a_1x1/kernel", "shape": [1, 1, 256, 32], "dtype": "float32"}, {"name": "Block35_5_Branch_2_Conv2d_0a_1x1_BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "Block35_5_Branch_2_Conv2d_0a_1x1_BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "Block35_5_Branch_2_Conv2d_0a_1x1_BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "Block35_5_Branch_1_Conv2d_0a_1x1/kernel", "shape": [1, 1, 256, 32], "dtype": "float32"}, {"name": "Block35_5_Branch_2_Conv2d_0b_3x3/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "Block35_5_Branch_1_Conv2d_0a_1x1_BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "Block35_5_Branch_1_Conv2d_0a_1x1_BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "Block35_5_Branch_1_Conv2d_0a_1x1_BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "Block35_5_Branch_2_Conv2d_0b_3x3_BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "Block35_5_Branch_2_Conv2d_0b_3x3_BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "Block35_5_Branch_2_Conv2d_0b_3x3_BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "Block35_5_Branch_0_Conv2d_1x1/kernel", "shape": [1, 1, 256, 32], "dtype": "float32"}, {"name": "Block35_5_Branch_1_Conv2d_0b_3x3/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "Block35_5_Branch_2_Conv2d_0c_3x3/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "Block35_5_Branch_0_Conv2d_1x1_BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "Block35_5_Branch_0_Conv2d_1x1_BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "Block35_5_Branch_0_Conv2d_1x1_BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "Block35_5_Branch_1_Conv2d_0b_3x3_BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "Block35_5_Branch_1_Conv2d_0b_3x3_BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "Block35_5_Branch_1_Conv2d_0b_3x3_BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "Block35_5_Branch_2_Conv2d_0c_3x3_BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "Block35_5_Branch_2_Conv2d_0c_3x3_BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "Block35_5_Branch_2_Conv2d_0c_3x3_BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "Block35_5_Conv2d_1x1/kernel", "shape": [1, 1, 96, 256], "dtype": "float32"}, {"name": "Block35_5_Conv2d_1x1/bias", "shape": [256], "dtype": "float32"}, {"name": "Mixed_6a_Branch_1_Conv2d_0a_1x1/kernel", "shape": [1, 1, 256, 192], "dtype": "float32"}, {"name": "Mixed_6a_Branch_1_Conv2d_0a_1x1_BatchNorm/beta", "shape": [192], "dtype": "float32"}, {"name": "Mixed_6a_Branch_1_Conv2d_0a_1x1_BatchNorm/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "Mixed_6a_Branch_1_Conv2d_0a_1x1_BatchNorm/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "Mixed_6a_Branch_1_Conv2d_0b_3x3/kernel", "shape": [3, 3, 192, 192], "dtype": "float32"}, {"name": "Mixed_6a_Branch_1_Conv2d_0b_3x3_BatchNorm/beta", "shape": [192], "dtype": "float32"}, {"name": "Mixed_6a_Branch_1_Conv2d_0b_3x3_BatchNorm/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "Mixed_6a_Branch_1_Conv2d_0b_3x3_BatchNorm/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "Mixed_6a_Branch_0_Conv2d_1a_3x3/kernel", "shape": [3, 3, 256, 384], "dtype": "float32"}, {"name": "Mixed_6a_Branch_1_Conv2d_1a_3x3/kernel", "shape": [3, 3, 192, 256], "dtype": "float32"}, {"name": "Mixed_6a_Branch_0_Conv2d_1a_3x3_BatchNorm/beta", "shape": [384], "dtype": "float32"}, {"name": "Mixed_6a_Branch_0_Conv2d_1a_3x3_BatchNorm/moving_mean", "shape": [384], "dtype": "float32"}, {"name": "Mixed_6a_Branch_0_Conv2d_1a_3x3_BatchNorm/moving_variance", "shape": [384], "dtype": "float32"}, {"name": "Mixed_6a_Branch_1_Conv2d_1a_3x3_BatchNorm/beta", "shape": [256], "dtype": "float32"}, {"name": "Mixed_6a_Branch_1_Conv2d_1a_3x3_BatchNorm/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "Mixed_6a_Branch_1_Conv2d_1a_3x3_BatchNorm/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "Block17_1_Branch_1_Conv2d_0a_1x1/kernel", "shape": [1, 1, 896, 128], "dtype": "float32"}, {"name": "Block17_1_Branch_1_Conv2d_0a_1x1_BatchNorm/beta", "shape": [128], "dtype": "float32"}, {"name": "Block17_1_Branch_1_Conv2d_0a_1x1_BatchNorm/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "Block17_1_Branch_1_Conv2d_0a_1x1_BatchNorm/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "Block17_1_Branch_1_Conv2d_0b_1x7/kernel", "shape": [1, 7, 128, 128], "dtype": "float32"}, {"name": "Block17_1_Branch_1_Conv2d_0b_1x7_BatchNorm/beta", "shape": [128], "dtype": "float32"}, {"name": "Block17_1_Branch_1_Conv2d_0b_1x7_BatchNorm/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "Block17_1_Branch_1_Conv2d_0b_1x7_BatchNorm/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "Block17_1_Branch_0_Conv2d_1x1/kernel", "shape": [1, 1, 896, 128], "dtype": "float32"}, {"name": "Block17_1_Branch_1_Conv2d_0c_7x1/kernel", "shape": [7, 1, 128, 128], "dtype": "float32"}, {"name": "Block17_1_Branch_0_Conv2d_1x1_BatchNorm/beta", "shape": [128], "dtype": "float32"}, {"name": "Block17_1_Branch_0_Conv2d_1x1_BatchNorm/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "Block17_1_Branch_0_Conv2d_1x1_BatchNorm/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "Block17_1_Branch_1_Conv2d_0c_7x1_BatchNorm/beta", "shape": [128], "dtype": "float32"}, {"name": "Block17_1_Branch_1_Conv2d_0c_7x1_BatchNorm/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "Block17_1_Branch_1_Conv2d_0c_7x1_BatchNorm/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "Block17_1_Conv2d_1x1/kernel", "shape": [1, 1, 256, 896], "dtype": "float32"}, {"name": "Block17_1_Conv2d_1x1/bias", "shape": [896], "dtype": "float32"}, {"name": "Block17_2_Branch_1_Conv2d_0a_1x1/kernel", "shape": [1, 1, 896, 128], "dtype": "float32"}, {"name": "Block17_2_Branch_1_Conv2d_0a_1x1_BatchNorm/beta", "shape": [128], "dtype": "float32"}, {"name": "Block17_2_Branch_1_Conv2d_0a_1x1_BatchNorm/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "Block17_2_Branch_1_Conv2d_0a_1x1_BatchNorm/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "Block17_2_Branch_1_Conv2d_0b_1x7/kernel", "shape": [1, 7, 128, 128], "dtype": "float32"}, {"name": "Block17_2_Branch_1_Conv2d_0b_1x7_BatchNorm/beta", "shape": [128], "dtype": "float32"}, {"name": "Block17_2_Branch_1_Conv2d_0b_1x7_BatchNorm/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "Block17_2_Branch_1_Conv2d_0b_1x7_BatchNorm/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "Block17_2_Branch_0_Conv2d_1x1/kernel", "shape": [1, 1, 896, 128], "dtype": "float32"}, {"name": "Block17_2_Branch_1_Conv2d_0c_7x1/kernel", "shape": [7, 1, 128, 128], "dtype": "float32"}, {"name": "Block17_2_Branch_0_Conv2d_1x1_BatchNorm/beta", "shape": [128], "dtype": "float32"}, {"name": "Block17_2_Branch_0_Conv2d_1x1_BatchNorm/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "Block17_2_Branch_0_Conv2d_1x1_BatchNorm/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "Block17_2_Branch_1_Conv2d_0c_7x1_BatchNorm/beta", "shape": [128], "dtype": "float32"}, {"name": "Block17_2_Branch_1_Conv2d_0c_7x1_BatchNorm/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "Block17_2_Branch_1_Conv2d_0c_7x1_BatchNorm/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "Block17_2_Conv2d_1x1/kernel", "shape": [1, 1, 256, 896], "dtype": "float32"}, {"name": "Block17_2_Conv2d_1x1/bias", "shape": [896], "dtype": "float32"}, {"name": "Block17_3_Branch_1_Conv2d_0a_1x1/kernel", "shape": [1, 1, 896, 128], "dtype": "float32"}, {"name": "Block17_3_Branch_1_Conv2d_0a_1x1_BatchNorm/beta", "shape": [128], "dtype": "float32"}, {"name": "Block17_3_Branch_1_Conv2d_0a_1x1_BatchNorm/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "Block17_3_Branch_1_Conv2d_0a_1x1_BatchNorm/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "Block17_3_Branch_1_Conv2d_0b_1x7/kernel", "shape": [1, 7, 128, 128], "dtype": "float32"}, {"name": "Block17_3_Branch_1_Conv2d_0b_1x7_BatchNorm/beta", "shape": [128], "dtype": "float32"}, {"name": "Block17_3_Branch_1_Conv2d_0b_1x7_BatchNorm/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "Block17_3_Branch_1_Conv2d_0b_1x7_BatchNorm/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "Block17_3_Branch_0_Conv2d_1x1/kernel", "shape": [1, 1, 896, 128], "dtype": "float32"}, {"name": "Block17_3_Branch_1_Conv2d_0c_7x1/kernel", "shape": [7, 1, 128, 128], "dtype": "float32"}, {"name": "Block17_3_Branch_0_Conv2d_1x1_BatchNorm/beta", "shape": [128], "dtype": "float32"}, {"name": "Block17_3_Branch_0_Conv2d_1x1_BatchNorm/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "Block17_3_Branch_0_Conv2d_1x1_BatchNorm/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "Block17_3_Branch_1_Conv2d_0c_7x1_BatchNorm/beta", "shape": [128], "dtype": "float32"}, {"name": "Block17_3_Branch_1_Conv2d_0c_7x1_BatchNorm/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "Block17_3_Branch_1_Conv2d_0c_7x1_BatchNorm/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "Block17_3_Conv2d_1x1/kernel", "shape": [1, 1, 256, 896], "dtype": "float32"}, {"name": "Block17_3_Conv2d_1x1/bias", "shape": [896], "dtype": "float32"}, {"name": "Block17_4_Branch_1_Conv2d_0a_1x1/kernel", "shape": [1, 1, 896, 128], "dtype": "float32"}, {"name": "Block17_4_Branch_1_Conv2d_0a_1x1_BatchNorm/beta", "shape": [128], "dtype": "float32"}, {"name": "Block17_4_Branch_1_Conv2d_0a_1x1_BatchNorm/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "Block17_4_Branch_1_Conv2d_0a_1x1_BatchNorm/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "Block17_4_Branch_1_Conv2d_0b_1x7/kernel", "shape": [1, 7, 128, 128], "dtype": "float32"}, {"name": "Block17_4_Branch_1_Conv2d_0b_1x7_BatchNorm/beta", "shape": [128], "dtype": "float32"}, {"name": "Block17_4_Branch_1_Conv2d_0b_1x7_BatchNorm/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "Block17_4_Branch_1_Conv2d_0b_1x7_BatchNorm/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "Block17_4_Branch_0_Conv2d_1x1/kernel", "shape": [1, 1, 896, 128], "dtype": "float32"}, {"name": "Block17_4_Branch_1_Conv2d_0c_7x1/kernel", "shape": [7, 1, 128, 128], "dtype": "float32"}, {"name": "Block17_4_Branch_0_Conv2d_1x1_BatchNorm/beta", "shape": [128], "dtype": "float32"}, {"name": "Block17_4_Branch_0_Conv2d_1x1_BatchNorm/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "Block17_4_Branch_0_Conv2d_1x1_BatchNorm/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "Block17_4_Branch_1_Conv2d_0c_7x1_BatchNorm/beta", "shape": [128], "dtype": "float32"}, {"name": "Block17_4_Branch_1_Conv2d_0c_7x1_BatchNorm/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "Block17_4_Branch_1_Conv2d_0c_7x1_BatchNorm/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "Block17_4_Conv2d_1x1/kernel", "shape": [1, 1, 256, 896], "dtype": "float32"}, {"name": "Block17_4_Conv2d_1x1/bias", "shape": [896], "dtype": "float32"}, {"name": "Block17_5_Branch_1_Conv2d_0a_1x1/kernel", "shape": [1, 1, 896, 128], "dtype": "float32"}, {"name": "Block17_5_Branch_1_Conv2d_0a_1x1_BatchNorm/beta", "shape": [128], "dtype": "float32"}, {"name": "Block17_5_Branch_1_Conv2d_0a_1x1_BatchNorm/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "Block17_5_Branch_1_Conv2d_0a_1x1_BatchNorm/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "Block17_5_Branch_1_Conv2d_0b_1x7/kernel", "shape": [1, 7, 128, 128], "dtype": "float32"}, {"name": "Block17_5_Branch_1_Conv2d_0b_1x7_BatchNorm/beta", "shape": [128], "dtype": "float32"}, {"name": "Block17_5_Branch_1_Conv2d_0b_1x7_BatchNorm/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "Block17_5_Branch_1_Conv2d_0b_1x7_BatchNorm/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "Block17_5_Branch_0_Conv2d_1x1/kernel", "shape": [1, 1, 896, 128], "dtype": "float32"}, {"name": "Block17_5_Branch_1_Conv2d_0c_7x1/kernel", "shape": [7, 1, 128, 128], "dtype": "float32"}, {"name": "Block17_5_Branch_0_Conv2d_1x1_BatchNorm/beta", "shape": [128], "dtype": "float32"}, {"name": "Block17_5_Branch_0_Conv2d_1x1_BatchNorm/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "Block17_5_Branch_0_Conv2d_1x1_BatchNorm/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "Block17_5_Branch_1_Conv2d_0c_7x1_BatchNorm/beta", "shape": [128], "dtype": "float32"}, {"name": "Block17_5_Branch_1_Conv2d_0c_7x1_BatchNorm/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "Block17_5_Branch_1_Conv2d_0c_7x1_BatchNorm/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "Block17_5_Conv2d_1x1/kernel", "shape": [1, 1, 256, 896], "dtype": "float32"}, {"name": "Block17_5_Conv2d_1x1/bias", "shape": [896], "dtype": "float32"}, {"name": "Block17_6_Branch_1_Conv2d_0a_1x1/kernel", "shape": [1, 1, 896, 128], "dtype": "float32"}, {"name": "Block17_6_Branch_1_Conv2d_0a_1x1_BatchNorm/beta", "shape": [128], "dtype": "float32"}, {"name": "Block17_6_Branch_1_Conv2d_0a_1x1_BatchNorm/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "Block17_6_Branch_1_Conv2d_0a_1x1_BatchNorm/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "Block17_6_Branch_1_Conv2d_0b_1x7/kernel", "shape": [1, 7, 128, 128], "dtype": "float32"}, {"name": "Block17_6_Branch_1_Conv2d_0b_1x7_BatchNorm/beta", "shape": [128], "dtype": "float32"}, {"name": "Block17_6_Branch_1_Conv2d_0b_1x7_BatchNorm/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "Block17_6_Branch_1_Conv2d_0b_1x7_BatchNorm/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "Block17_6_Branch_0_Conv2d_1x1/kernel", "shape": [1, 1, 896, 128], "dtype": "float32"}, {"name": "Block17_6_Branch_1_Conv2d_0c_7x1/kernel", "shape": [7, 1, 128, 128], "dtype": "float32"}, {"name": "Block17_6_Branch_0_Conv2d_1x1_BatchNorm/beta", "shape": [128], "dtype": "float32"}, {"name": "Block17_6_Branch_0_Conv2d_1x1_BatchNorm/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "Block17_6_Branch_0_Conv2d_1x1_BatchNorm/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "Block17_6_Branch_1_Conv2d_0c_7x1_BatchNorm/beta", "shape": [128], "dtype": "float32"}, {"name": "Block17_6_Branch_1_Conv2d_0c_7x1_BatchNorm/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "Block17_6_Branch_1_Conv2d_0c_7x1_BatchNorm/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "Block17_6_Conv2d_1x1/kernel", "shape": [1, 1, 256, 896], "dtype": "float32"}, {"name": "Block17_6_Conv2d_1x1/bias", "shape": [896], "dtype": "float32"}, {"name": "Block17_7_Branch_1_Conv2d_0a_1x1/kernel", "shape": [1, 1, 896, 128], "dtype": "float32"}, {"name": "Block17_7_Branch_1_Conv2d_0a_1x1_BatchNorm/beta", "shape": [128], "dtype": "float32"}, {"name": "Block17_7_Branch_1_Conv2d_0a_1x1_BatchNorm/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "Block17_7_Branch_1_Conv2d_0a_1x1_BatchNorm/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "Block17_7_Branch_1_Conv2d_0b_1x7/kernel", "shape": [1, 7, 128, 128], "dtype": "float32"}, {"name": "Block17_7_Branch_1_Conv2d_0b_1x7_BatchNorm/beta", "shape": [128], "dtype": "float32"}, {"name": "Block17_7_Branch_1_Conv2d_0b_1x7_BatchNorm/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "Block17_7_Branch_1_Conv2d_0b_1x7_BatchNorm/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "Block17_7_Branch_0_Conv2d_1x1/kernel", "shape": [1, 1, 896, 128], "dtype": "float32"}, {"name": "Block17_7_Branch_1_Conv2d_0c_7x1/kernel", "shape": [7, 1, 128, 128], "dtype": "float32"}, {"name": "Block17_7_Branch_0_Conv2d_1x1_BatchNorm/beta", "shape": [128], "dtype": "float32"}, {"name": "Block17_7_Branch_0_Conv2d_1x1_BatchNorm/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "Block17_7_Branch_0_Conv2d_1x1_BatchNorm/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "Block17_7_Branch_1_Conv2d_0c_7x1_BatchNorm/beta", "shape": [128], "dtype": "float32"}, {"name": "Block17_7_Branch_1_Conv2d_0c_7x1_BatchNorm/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "Block17_7_Branch_1_Conv2d_0c_7x1_BatchNorm/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "Block17_7_Conv2d_1x1/kernel", "shape": [1, 1, 256, 896], "dtype": "float32"}, {"name": "Block17_7_Conv2d_1x1/bias", "shape": [896], "dtype": "float32"}, {"name": "Block17_8_Branch_1_Conv2d_0a_1x1/kernel", "shape": [1, 1, 896, 128], "dtype": "float32"}, {"name": "Block17_8_Branch_1_Conv2d_0a_1x1_BatchNorm/beta", "shape": [128], "dtype": "float32"}, {"name": "Block17_8_Branch_1_Conv2d_0a_1x1_BatchNorm/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "Block17_8_Branch_1_Conv2d_0a_1x1_BatchNorm/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "Block17_8_Branch_1_Conv2d_0b_1x7/kernel", "shape": [1, 7, 128, 128], "dtype": "float32"}, {"name": "Block17_8_Branch_1_Conv2d_0b_1x7_BatchNorm/beta", "shape": [128], "dtype": "float32"}, {"name": "Block17_8_Branch_1_Conv2d_0b_1x7_BatchNorm/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "Block17_8_Branch_1_Conv2d_0b_1x7_BatchNorm/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "Block17_8_Branch_0_Conv2d_1x1/kernel", "shape": [1, 1, 896, 128], "dtype": "float32"}, {"name": "Block17_8_Branch_1_Conv2d_0c_7x1/kernel", "shape": [7, 1, 128, 128], "dtype": "float32"}, {"name": "Block17_8_Branch_0_Conv2d_1x1_BatchNorm/beta", "shape": [128], "dtype": "float32"}, {"name": "Block17_8_Branch_0_Conv2d_1x1_BatchNorm/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "Block17_8_Branch_0_Conv2d_1x1_BatchNorm/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "Block17_8_Branch_1_Conv2d_0c_7x1_BatchNorm/beta", "shape": [128], "dtype": "float32"}, {"name": "Block17_8_Branch_1_Conv2d_0c_7x1_BatchNorm/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "Block17_8_Branch_1_Conv2d_0c_7x1_BatchNorm/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "Block17_8_Conv2d_1x1/kernel", "shape": [1, 1, 256, 896], "dtype": "float32"}, {"name": "Block17_8_Conv2d_1x1/bias", "shape": [896], "dtype": "float32"}, {"name": "Block17_9_Branch_1_Conv2d_0a_1x1/kernel", "shape": [1, 1, 896, 128], "dtype": "float32"}, {"name": "Block17_9_Branch_1_Conv2d_0a_1x1_BatchNorm/beta", "shape": [128], "dtype": "float32"}, {"name": "Block17_9_Branch_1_Conv2d_0a_1x1_BatchNorm/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "Block17_9_Branch_1_Conv2d_0a_1x1_BatchNorm/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "Block17_9_Branch_1_Conv2d_0b_1x7/kernel", "shape": [1, 7, 128, 128], "dtype": "float32"}, {"name": "Block17_9_Branch_1_Conv2d_0b_1x7_BatchNorm/beta", "shape": [128], "dtype": "float32"}, {"name": "Block17_9_Branch_1_Conv2d_0b_1x7_BatchNorm/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "Block17_9_Branch_1_Conv2d_0b_1x7_BatchNorm/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "Block17_9_Branch_0_Conv2d_1x1/kernel", "shape": [1, 1, 896, 128], "dtype": "float32"}, {"name": "Block17_9_Branch_1_Conv2d_0c_7x1/kernel", "shape": [7, 1, 128, 128], "dtype": "float32"}, {"name": "Block17_9_Branch_0_Conv2d_1x1_BatchNorm/beta", "shape": [128], "dtype": "float32"}, {"name": "Block17_9_Branch_0_Conv2d_1x1_BatchNorm/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "Block17_9_Branch_0_Conv2d_1x1_BatchNorm/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "Block17_9_Branch_1_Conv2d_0c_7x1_BatchNorm/beta", "shape": [128], "dtype": "float32"}, {"name": "Block17_9_Branch_1_Conv2d_0c_7x1_BatchNorm/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "Block17_9_Branch_1_Conv2d_0c_7x1_BatchNorm/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "Block17_9_Conv2d_1x1/kernel", "shape": [1, 1, 256, 896], "dtype": "float32"}, {"name": "Block17_9_Conv2d_1x1/bias", "shape": [896], "dtype": "float32"}, {"name": "Block17_10_Branch_1_Conv2d_0a_1x1/kernel", "shape": [1, 1, 896, 128], "dtype": "float32"}, {"name": "Block17_10_Branch_1_Conv2d_0a_1x1_BatchNorm/beta", "shape": [128], "dtype": "float32"}, {"name": "Block17_10_Branch_1_Conv2d_0a_1x1_BatchNorm/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "Block17_10_Branch_1_Conv2d_0a_1x1_BatchNorm/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "Block17_10_Branch_1_Conv2d_0b_1x7/kernel", "shape": [1, 7, 128, 128], "dtype": "float32"}, {"name": "Block17_10_Branch_1_Conv2d_0b_1x7_BatchNorm/beta", "shape": [128], "dtype": "float32"}, {"name": "Block17_10_Branch_1_Conv2d_0b_1x7_BatchNorm/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "Block17_10_Branch_1_Conv2d_0b_1x7_BatchNorm/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "Block17_10_Branch_0_Conv2d_1x1/kernel", "shape": [1, 1, 896, 128], "dtype": "float32"}, {"name": "Block17_10_Branch_1_Conv2d_0c_7x1/kernel", "shape": [7, 1, 128, 128], "dtype": "float32"}, {"name": "Block17_10_Branch_0_Conv2d_1x1_BatchNorm/beta", "shape": [128], "dtype": "float32"}, {"name": "Block17_10_Branch_0_Conv2d_1x1_BatchNorm/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "Block17_10_Branch_0_Conv2d_1x1_BatchNorm/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "Block17_10_Branch_1_Conv2d_0c_7x1_BatchNorm/beta", "shape": [128], "dtype": "float32"}, {"name": "Block17_10_Branch_1_Conv2d_0c_7x1_BatchNorm/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "Block17_10_Branch_1_Conv2d_0c_7x1_BatchNorm/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "Block17_10_Conv2d_1x1/kernel", "shape": [1, 1, 256, 896], "dtype": "float32"}, {"name": "Block17_10_Conv2d_1x1/bias", "shape": [896], "dtype": "float32"}, {"name": "Mixed_7a_Branch_2_Conv2d_0a_1x1/kernel", "shape": [1, 1, 896, 256], "dtype": "float32"}, {"name": "Mixed_7a_Branch_2_Conv2d_0a_1x1_BatchNorm/beta", "shape": [256], "dtype": "float32"}, {"name": "Mixed_7a_Branch_2_Conv2d_0a_1x1_BatchNorm/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "Mixed_7a_Branch_2_Conv2d_0a_1x1_BatchNorm/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "Mixed_7a_Branch_0_Conv2d_0a_1x1/kernel", "shape": [1, 1, 896, 256], "dtype": "float32"}, {"name": "Mixed_7a_Branch_1_Conv2d_0a_1x1/kernel", "shape": [1, 1, 896, 256], "dtype": "float32"}, {"name": "Mixed_7a_Branch_2_Conv2d_0b_3x3/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "Mixed_7a_Branch_0_Conv2d_0a_1x1_BatchNorm/beta", "shape": [256], "dtype": "float32"}, {"name": "Mixed_7a_Branch_0_Conv2d_0a_1x1_BatchNorm/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "Mixed_7a_Branch_0_Conv2d_0a_1x1_BatchNorm/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "Mixed_7a_Branch_1_Conv2d_0a_1x1_BatchNorm/beta", "shape": [256], "dtype": "float32"}, {"name": "Mixed_7a_Branch_1_Conv2d_0a_1x1_BatchNorm/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "Mixed_7a_Branch_1_Conv2d_0a_1x1_BatchNorm/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "Mixed_7a_Branch_2_Conv2d_0b_3x3_BatchNorm/beta", "shape": [256], "dtype": "float32"}, {"name": "Mixed_7a_Branch_2_Conv2d_0b_3x3_BatchNorm/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "Mixed_7a_Branch_2_Conv2d_0b_3x3_BatchNorm/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "Mixed_7a_Branch_0_Conv2d_1a_3x3/kernel", "shape": [3, 3, 256, 384], "dtype": "float32"}, {"name": "Mixed_7a_Branch_1_Conv2d_1a_3x3/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "Mixed_7a_Branch_2_Conv2d_1a_3x3/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "Mixed_7a_Branch_0_Conv2d_1a_3x3_BatchNorm/beta", "shape": [384], "dtype": "float32"}, {"name": "Mixed_7a_Branch_0_Conv2d_1a_3x3_BatchNorm/moving_mean", "shape": [384], "dtype": "float32"}, {"name": "Mixed_7a_Branch_0_Conv2d_1a_3x3_BatchNorm/moving_variance", "shape": [384], "dtype": "float32"}, {"name": "Mixed_7a_Branch_1_Conv2d_1a_3x3_BatchNorm/beta", "shape": [256], "dtype": "float32"}, {"name": "Mixed_7a_Branch_1_Conv2d_1a_3x3_BatchNorm/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "Mixed_7a_Branch_1_Conv2d_1a_3x3_BatchNorm/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "Mixed_7a_Branch_2_Conv2d_1a_3x3_BatchNorm/beta", "shape": [256], "dtype": "float32"}, {"name": "Mixed_7a_Branch_2_Conv2d_1a_3x3_BatchNorm/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "Mixed_7a_Branch_2_Conv2d_1a_3x3_BatchNorm/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "Block8_1_Branch_1_Conv2d_0a_1x1/kernel", "shape": [1, 1, 1792, 192], "dtype": "float32"}, {"name": "Block8_1_Branch_1_Conv2d_0a_1x1_BatchNorm/beta", "shape": [192], "dtype": "float32"}, {"name": "Block8_1_Branch_1_Conv2d_0a_1x1_BatchNorm/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "Block8_1_Branch_1_Conv2d_0a_1x1_BatchNorm/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "Block8_1_Branch_1_Conv2d_0b_1x3/kernel", "shape": [1, 3, 192, 192], "dtype": "float32"}, {"name": "Block8_1_Branch_1_Conv2d_0b_1x3_BatchNorm/beta", "shape": [192], "dtype": "float32"}, {"name": "Block8_1_Branch_1_Conv2d_0b_1x3_BatchNorm/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "Block8_1_Branch_1_Conv2d_0b_1x3_BatchNorm/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "Block8_1_Branch_0_Conv2d_1x1/kernel", "shape": [1, 1, 1792, 192], "dtype": "float32"}, {"name": "Block8_1_Branch_1_Conv2d_0c_3x1/kernel", "shape": [3, 1, 192, 192], "dtype": "float32"}, {"name": "Block8_1_Branch_0_Conv2d_1x1_BatchNorm/beta", "shape": [192], "dtype": "float32"}, {"name": "Block8_1_Branch_0_Conv2d_1x1_BatchNorm/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "Block8_1_Branch_0_Conv2d_1x1_BatchNorm/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "Block8_1_Branch_1_Conv2d_0c_3x1_BatchNorm/beta", "shape": [192], "dtype": "float32"}, {"name": "Block8_1_Branch_1_Conv2d_0c_3x1_BatchNorm/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "Block8_1_Branch_1_Conv2d_0c_3x1_BatchNorm/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "Block8_1_Conv2d_1x1/kernel", "shape": [1, 1, 384, 1792], "dtype": "float32"}, {"name": "Block8_1_Conv2d_1x1/bias", "shape": [1792], "dtype": "float32"}, {"name": "Block8_2_Branch_1_Conv2d_0a_1x1/kernel", "shape": [1, 1, 1792, 192], "dtype": "float32"}, {"name": "Block8_2_Branch_1_Conv2d_0a_1x1_BatchNorm/beta", "shape": [192], "dtype": "float32"}, {"name": "Block8_2_Branch_1_Conv2d_0a_1x1_BatchNorm/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "Block8_2_Branch_1_Conv2d_0a_1x1_BatchNorm/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "Block8_2_Branch_1_Conv2d_0b_1x3/kernel", "shape": [1, 3, 192, 192], "dtype": "float32"}, {"name": "Block8_2_Branch_1_Conv2d_0b_1x3_BatchNorm/beta", "shape": [192], "dtype": "float32"}, {"name": "Block8_2_Branch_1_Conv2d_0b_1x3_BatchNorm/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "Block8_2_Branch_1_Conv2d_0b_1x3_BatchNorm/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "Block8_2_Branch_0_Conv2d_1x1/kernel", "shape": [1, 1, 1792, 192], "dtype": "float32"}, {"name": "Block8_2_Branch_1_Conv2d_0c_3x1/kernel", "shape": [3, 1, 192, 192], "dtype": "float32"}, {"name": "Block8_2_Branch_0_Conv2d_1x1_BatchNorm/beta", "shape": [192], "dtype": "float32"}, {"name": "Block8_2_Branch_0_Conv2d_1x1_BatchNorm/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "Block8_2_Branch_0_Conv2d_1x1_BatchNorm/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "Block8_2_Branch_1_Conv2d_0c_3x1_BatchNorm/beta", "shape": [192], "dtype": "float32"}, {"name": "Block8_2_Branch_1_Conv2d_0c_3x1_BatchNorm/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "Block8_2_Branch_1_Conv2d_0c_3x1_BatchNorm/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "Block8_2_Conv2d_1x1/kernel", "shape": [1, 1, 384, 1792], "dtype": "float32"}, {"name": "Block8_2_Conv2d_1x1/bias", "shape": [1792], "dtype": "float32"}, {"name": "Block8_3_Branch_1_Conv2d_0a_1x1/kernel", "shape": [1, 1, 1792, 192], "dtype": "float32"}, {"name": "Block8_3_Branch_1_Conv2d_0a_1x1_BatchNorm/beta", "shape": [192], "dtype": "float32"}, {"name": "Block8_3_Branch_1_Conv2d_0a_1x1_BatchNorm/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "Block8_3_Branch_1_Conv2d_0a_1x1_BatchNorm/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "Block8_3_Branch_1_Conv2d_0b_1x3/kernel", "shape": [1, 3, 192, 192], "dtype": "float32"}, {"name": "Block8_3_Branch_1_Conv2d_0b_1x3_BatchNorm/beta", "shape": [192], "dtype": "float32"}, {"name": "Block8_3_Branch_1_Conv2d_0b_1x3_BatchNorm/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "Block8_3_Branch_1_Conv2d_0b_1x3_BatchNorm/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "Block8_3_Branch_0_Conv2d_1x1/kernel", "shape": [1, 1, 1792, 192], "dtype": "float32"}, {"name": "Block8_3_Branch_1_Conv2d_0c_3x1/kernel", "shape": [3, 1, 192, 192], "dtype": "float32"}, {"name": "Block8_3_Branch_0_Conv2d_1x1_BatchNorm/beta", "shape": [192], "dtype": "float32"}, {"name": "Block8_3_Branch_0_Conv2d_1x1_BatchNorm/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "Block8_3_Branch_0_Conv2d_1x1_BatchNorm/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "Block8_3_Branch_1_Conv2d_0c_3x1_BatchNorm/beta", "shape": [192], "dtype": "float32"}, {"name": "Block8_3_Branch_1_Conv2d_0c_3x1_BatchNorm/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "Block8_3_Branch_1_Conv2d_0c_3x1_BatchNorm/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "Block8_3_Conv2d_1x1/kernel", "shape": [1, 1, 384, 1792], "dtype": "float32"}, {"name": "Block8_3_Conv2d_1x1/bias", "shape": [1792], "dtype": "float32"}, {"name": "Block8_4_Branch_1_Conv2d_0a_1x1/kernel", "shape": [1, 1, 1792, 192], "dtype": "float32"}, {"name": "Block8_4_Branch_1_Conv2d_0a_1x1_BatchNorm/beta", "shape": [192], "dtype": "float32"}, {"name": "Block8_4_Branch_1_Conv2d_0a_1x1_BatchNorm/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "Block8_4_Branch_1_Conv2d_0a_1x1_BatchNorm/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "Block8_4_Branch_1_Conv2d_0b_1x3/kernel", "shape": [1, 3, 192, 192], "dtype": "float32"}, {"name": "Block8_4_Branch_1_Conv2d_0b_1x3_BatchNorm/beta", "shape": [192], "dtype": "float32"}, {"name": "Block8_4_Branch_1_Conv2d_0b_1x3_BatchNorm/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "Block8_4_Branch_1_Conv2d_0b_1x3_BatchNorm/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "Block8_4_Branch_0_Conv2d_1x1/kernel", "shape": [1, 1, 1792, 192], "dtype": "float32"}, {"name": "Block8_4_Branch_1_Conv2d_0c_3x1/kernel", "shape": [3, 1, 192, 192], "dtype": "float32"}, {"name": "Block8_4_Branch_0_Conv2d_1x1_BatchNorm/beta", "shape": [192], "dtype": "float32"}, {"name": "Block8_4_Branch_0_Conv2d_1x1_BatchNorm/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "Block8_4_Branch_0_Conv2d_1x1_BatchNorm/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "Block8_4_Branch_1_Conv2d_0c_3x1_BatchNorm/beta", "shape": [192], "dtype": "float32"}, {"name": "Block8_4_Branch_1_Conv2d_0c_3x1_BatchNorm/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "Block8_4_Branch_1_Conv2d_0c_3x1_BatchNorm/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "Block8_4_Conv2d_1x1/kernel", "shape": [1, 1, 384, 1792], "dtype": "float32"}, {"name": "Block8_4_Conv2d_1x1/bias", "shape": [1792], "dtype": "float32"}, {"name": "Block8_5_Branch_1_Conv2d_0a_1x1/kernel", "shape": [1, 1, 1792, 192], "dtype": "float32"}, {"name": "Block8_5_Branch_1_Conv2d_0a_1x1_BatchNorm/beta", "shape": [192], "dtype": "float32"}, {"name": "Block8_5_Branch_1_Conv2d_0a_1x1_BatchNorm/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "Block8_5_Branch_1_Conv2d_0a_1x1_BatchNorm/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "Block8_5_Branch_1_Conv2d_0b_1x3/kernel", "shape": [1, 3, 192, 192], "dtype": "float32"}, {"name": "Block8_5_Branch_1_Conv2d_0b_1x3_BatchNorm/beta", "shape": [192], "dtype": "float32"}, {"name": "Block8_5_Branch_1_Conv2d_0b_1x3_BatchNorm/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "Block8_5_Branch_1_Conv2d_0b_1x3_BatchNorm/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "Block8_5_Branch_0_Conv2d_1x1/kernel", "shape": [1, 1, 1792, 192], "dtype": "float32"}, {"name": "Block8_5_Branch_1_Conv2d_0c_3x1/kernel", "shape": [3, 1, 192, 192], "dtype": "float32"}, {"name": "Block8_5_Branch_0_Conv2d_1x1_BatchNorm/beta", "shape": [192], "dtype": "float32"}, {"name": "Block8_5_Branch_0_Conv2d_1x1_BatchNorm/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "Block8_5_Branch_0_Conv2d_1x1_BatchNorm/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "Block8_5_Branch_1_Conv2d_0c_3x1_BatchNorm/beta", "shape": [192], "dtype": "float32"}, {"name": "Block8_5_Branch_1_Conv2d_0c_3x1_BatchNorm/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "Block8_5_Branch_1_Conv2d_0c_3x1_BatchNorm/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "Block8_5_Conv2d_1x1/kernel", "shape": [1, 1, 384, 1792], "dtype": "float32"}, {"name": "Block8_5_Conv2d_1x1/bias", "shape": [1792], "dtype": "float32"}, {"name": "Block8_6_Branch_1_Conv2d_0a_1x1/kernel", "shape": [1, 1, 1792, 192], "dtype": "float32"}, {"name": "Block8_6_Branch_1_Conv2d_0a_1x1_BatchNorm/beta", "shape": [192], "dtype": "float32"}, {"name": "Block8_6_Branch_1_Conv2d_0a_1x1_BatchNorm/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "Block8_6_Branch_1_Conv2d_0a_1x1_BatchNorm/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "Block8_6_Branch_1_Conv2d_0b_1x3/kernel", "shape": [1, 3, 192, 192], "dtype": "float32"}, {"name": "Block8_6_Branch_1_Conv2d_0b_1x3_BatchNorm/beta", "shape": [192], "dtype": "float32"}, {"name": "Block8_6_Branch_1_Conv2d_0b_1x3_BatchNorm/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "Block8_6_Branch_1_Conv2d_0b_1x3_BatchNorm/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "Block8_6_Branch_0_Conv2d_1x1/kernel", "shape": [1, 1, 1792, 192], "dtype": "float32"}, {"name": "Block8_6_Branch_1_Conv2d_0c_3x1/kernel", "shape": [3, 1, 192, 192], "dtype": "float32"}, {"name": "Block8_6_Branch_0_Conv2d_1x1_BatchNorm/beta", "shape": [192], "dtype": "float32"}, {"name": "Block8_6_Branch_0_Conv2d_1x1_BatchNorm/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "Block8_6_Branch_0_Conv2d_1x1_BatchNorm/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "Block8_6_Branch_1_Conv2d_0c_3x1_BatchNorm/beta", "shape": [192], "dtype": "float32"}, {"name": "Block8_6_Branch_1_Conv2d_0c_3x1_BatchNorm/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "Block8_6_Branch_1_Conv2d_0c_3x1_BatchNorm/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "Block8_6_Conv2d_1x1/kernel", "shape": [1, 1, 384, 1792], "dtype": "float32"}, {"name": "Block8_6_Conv2d_1x1/bias", "shape": [1792], "dtype": "float32"}, {"name": "Bottleneck/kernel", "shape": [1792, 128], "dtype": "float32"}, {"name": "Bottleneck_BatchNorm/beta", "shape": [128], "dtype": "float32"}, {"name": "Bottleneck_BatchNorm/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "Bottleneck_BatchNorm/moving_variance", "shape": [128], "dtype": "float32"}]}]}